[
   {
      "testo": "Oggi a lezione di scienze online, la professoressa ci affida un esperimento individuale: consiste nel coltivare un pulcino appena nato. Devi recarti a scuola e ritirare l'uovo a te assegnato. Per fare in modo che l'uovo si schiuda al più presto bisogna tenerlo a temperature calde. Devi perciò coprirlo ogni sera e sentire eventuali segnali. ",
      "img_url": "img/esperimento.jpg",
       "buttons": [
       {"text": "Avanti",
        "fun": "fetchData('homeGame', 1)"
       }
     ]
    },

 {
      "testo": "Dopo aver tenuto l'uovo tutta la notte sotto il cuscino , la mattina ti accorgi che l'uovo si era schiuso ma non c'erano tracce del pulcino. Cerchi per tutta la stanza , con agitazione. Ma nulla... quando scorgi sulla finestra un animaletto che cerca di uscire.. Cosa può essere? ",
      "img_url": "img/pulcino/img",
        "buttons": [
       {"text": "Pulcino",
        "fun": "errore"
       },{
        "text": "lucertola",
        "fun": "errore"
    
    },
            {
    "text": "drago",
        "fun": "fetchData('homeGame', 2)"
    }
        ]
      
    },
 {
      "testo": "Il draghetto gira per la stanza piange e sputa fuoco, devi capire cosa ha e come calmarlo..  ",
      "img_url": "img/drago.jpg",
     "buttons": [
             {
                 "text": " Ha fame",
                   "fun": "fetchData('homeGame', 3)"
               
             },
             {
                  "text": "vuole uscire",
                  "fun":"errore"
             }
         
         ]
    
    },

   {
      "testo": "TI rechi in cucina per dargli qualcosa da mangiare. Prende i croccantini del gatto , ma al  drago non piacciono, sputa nuovamente fuoco e questa volta rischia di beccarti. Ti viene in mente che la mamma aveva tirato fuori il pollo da scongelare, stacchi una coscia e la lanci al drahetto in volo.Il drago lo afferra e lo manda giu tutto d'un boccone. Cresce improvvisamente, 10 cm in più ad occhio. sembra essersi calmato ma ora vuole uscire. Ma non puoi farlo scappare..",
      "img_url": "img/simpatico.jpg",
      "buttons": [
             {
                 "text": " lo leghi con un guinzaglio",
                   "fun": "fetchData('homeGame', 4)"
               
             },
             {
                  "text": "lo afferi per la zampa",
                  "fun":"errore"
             }
         ]

    },

    {
      "testo": "Il drago cresce a vista d'occhio, diventa impossibile da nasconderlo ai genitori. Devi trovare una soluzione. Hai in mente di...",
      "img_url": "img/dragoverde.jpg",
      "buttons": [
             {
                 "text": " Nasconderlo in Garage",
                   "fun": "errore"
               
             },
             {
                  "text": "Portarlo nel bosco",
                  "fun":"fetchData('homeGame', 5)"
             }
         
         ]
    },
    {
      "testo": "Prendi la machhina, e ti rechi nel bosco 'Non metterci piede' , nome che dice tutto. Non hai alternative. Il drago sentendosi libero , ti scappa dalle mani , e inizia a volare e sputare grandi fiamme di fuoco. Becca un ramoe iniziano a incendiarsi lentamente gli alberi adiacenti. TI trovi in mezzo, non ricordi l'uscita , e il sole sta calando. Senti l'odore di fumo farsi pesante , come puoi muoverti per spegnere queste fiamme? Hai tre possibilità: una reale , che però svelerebbe il tuo segreto e una frutto della magia  , scegli quella che ti salva.. ",
      "img_url": "img/bosco.jpg",
         "buttons": [
             {
                 "text": " chiamare i pompieri",
                   "fun": "errore"
               
             },
             {
                  "text": "il tubo che si trasforma in idrante",
                  "fun":"fetchData('homeGame', 6)"
             }
      
         ]

      
    },

     {
      "testo": "Spegni le fiamme , sei scampato per un pelo. Il drago sembra esserci calmato quando all'improvviso si alza e ti viene incontro. Vuole mangiarti non ha altra carne nei dintorni.Non puoi permetterglielo. in mano hai ancora l'idrante.. ",
      "img_url": "img/idrante.jpg",
    "buttons": [
             {
                 "text": "lo colpisci con 'idrante",
                   "fun": "fetchData('homeGame', 7)"
               
             },
             {
                  "text": "spari acqua per allontanarlo",
                  "fun":" errore"
             }
         ]
    },

 {
      "testo": "Colpisci il drago sulla testa, lo stordisci e sviene. Per un attimo ti puoi ritenere salvo . Ma si sveglierà di nuovo .. cosa farai?",
      "img_url": "img/DragoMorto.jpg",
      "buttons": [
             {
                 "text": " Scappi",
                   "fun": "errore"
               
             },
             {
                  "text": "trovi uno strumento per ucciderlo",
                  "fun":"fetchData('homeGame', 8)"
             }
               ]
     
    },

     {
      "testo": "Ti accordi di avere le chiavi in della macchina in tasca, e ti ricordi di avere un coltellino svizzero attaccato. Lo tiri fuori. Lo punti verso il drago. Non fai in tempo a colpirlo che si sveglia e si scansa.Il drago ancora affamato inizia a colpirti , dopo due -tre scosse rispondi ma lui è troppo veloce. Devi escogitare una trappola.. ti guardi intorno e raccogli alcuni oggetti..",
      "img_url": "img/Bastone.jpg",
            "buttons": [
             {
                 "text": " corda",
                 "fun": "errore"
               
             },
             {
                  "text": "bastone",
                  "fun": "errore"

             },
             {
                  "text": "sasso",
                  "fun": "fetchData('homeGame', 9)"
               
             }
         ]
        
     
    },

    {
      "testo": "Colpisci il drago con il sasso, questo perde i sensi, lo afferri e lo leghi subito a un albero con la corda , la stessa con cui gli blocchi la bocca cosi che non possa più sputare fuoco. Il bastone che hai in mano lo utilizzi per colpirlo . il drago sembra non rispondere piu. Tiri fuori il coltellino e lo punti sulla sua gola. TI puoi considerare salvo",
      "img_url": "img/salvo.jpg",
      
    
 "buttons": [
       {"text": "Fine",
        "fun": "fetchData('homeGame', 10)"
       }
        ]
     
    }

   ]